That's really it... I haven't changed anything and I've applied it a few times. This is the entire change message:

```
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # null_resource.cluster_aws_auth must be replaced
-/+ resource "null_resource" "cluster_aws_auth" {
      ~ id       = "6321794093568713192" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "kubeconfig" = (sensitive)
            # (1 unchanged element hidden)
        }
    }

  # module.eks.module.eks_managed_node_group["default"].aws_eks_node_group.this[0] will be updated in-place
  ~ resource "aws_eks_node_group" "this" {
        id                     = "ops01:default-20220119201738680800000008"
        tags                   = {
            "Name"                              = "default"
            "k8s.io/cluster-autoscaler/enabled" = "TRUE"
            "k8s.io/cluster-autoscaler/<redacted>"   = "owned"
        }
        # (16 unchanged attributes hidden)

      ~ launch_template {
            id      = "lt-08064b5874aab041c"
            name    = "default-20220119201738044800000006"
          ~ version = "6" -> (known after apply)
        }



        # (3 unchanged blocks hidden)
    }

  # module.eks.module.eks_managed_node_group["default"].aws_launch_template.this[0] will be updated in-place
  ~ resource "aws_launch_template" "this" {
      ~ default_version         = 6 -> (known after apply)
        id                      = "lt-08064b5874aab041c"
      ~ latest_version          = 6 -> (known after apply)
        name                    = "default-20220119201738044800000006"
        tags                    = {
            "k8s.io/cluster-autoscaler/enabled" = "TRUE"
            "k8s.io/cluster-autoscaler/<redacted>"   = "owned"
        }
        # (8 unchanged attributes hidden)



      + placement {}

        # (5 unchanged blocks hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.
```